app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `correo` = 'businesscycloidtalent@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $correo  = $this->request->getVar('correo');
        $password = $this->request->getVar('password');

        $usuario = $this->userModel->where('correo', $correo)->first();

SELECT *
FROM `users`
WHERE `correo` = 'cycloidtalent@gmail.com'
 LIMIT 1
UPDATE `users` SET `reset_token` = 'f4ca815149006c06abcb9fe98d6145ac3d7310ea21c807924713d95aff105519', `reset_token_expira` = '2025-07-22 18:21:01'
WHERE `users`.`id_users` IN ('19')
---
    public function procesarRecuperar()
    {
        helper(['url', 'form', 'session']);

        $correo = $this->request->getPost('correo');
        if (empty($correo)) {
            return redirect()->back()->with('error', 'Por favor ingresa tu correo electrónico.');
        }

        $userModel = new \App\Models\UserModel();
        $usuario = $userModel->where('correo', $correo)->first();

        if (!$usuario) {
            return redirect()->back()->with('error', 'No se encontró una cuenta con ese correo.');
        }

        // Generar token único
        $token = bin2hex(random_bytes(32));

        // Guardar token en DB y/o en cache/temporal
        $userModel->update($usuario['id_users'], [
            'reset_token' => $token,
            'reset_token_expira' => date('Y-m-d H:i:s', strtotime('+1 hour'))
        ]);

SELECT *
FROM `users`
WHERE `reset_token` = '6efe1e083c678ded2ade3869c6d5072cbf607631874b69929f44ad47f091f119'
 LIMIT 1
---
    public function formResetear($token = null)
    {
        if (!$token) {
            return redirect()->to('/login')->with('error', 'Token de recuperación no válido.');
        }

        $userModel = new \App\Models\UserModel();
        $usuario = $userModel->where('reset_token', $token)->first();

SELECT *
FROM `users`
WHERE `reset_token` = '6efe1e083c678ded2ade3869c6d5072cbf607631874b69929f44ad47f091f119'
 LIMIT 1
UPDATE `users` SET `password` = '$2y$10$whSB3E03a7Is7YoxnV7XvegVdpmFaWond5.l14iwtFIipDoy3oasy', `reset_token` = NULL, `reset_token_expira` = NULL, `primer_login` = 0
WHERE `users`.`id_users` IN ('19')
---
    public function procesarResetear()
    {
        $token = $this->request->getPost('token');
        $password = $this->request->getPost('password');

        if (!$token || !$password) {
            return redirect()->back()->with('error', 'Todos los campos son obligatorios.');
        }

        $userModel = new \App\Models\UserModel();
        $usuario = $userModel->where('reset_token', $token)->first();

        if (!$usuario) {
            return redirect()->to('/login')->with('error', 'Token inválido.');
        }

        // Validar expiración
        $fechaExpira = Time::parse($usuario['reset_token_expira']);
        if ($fechaExpira->isBefore(Time::now())) {
            return redirect()->to('/login')->with('error', 'El enlace ha expirado.');
        }

        // Actualiza la contraseña y limpia el token
        $userModel->update($usuario['id_users'], [
            'password' => password_hash($password, PASSWORD_DEFAULT),
            'reset_token' => null,
            'reset_token_expira' => null,
            'primer_login' => 0 // opcional: marca como ya reestablecido
        ]);