app/Controllers/EquipoController.php

SELECT `equipos`.*, `uj`.`nombre_completo` as `jefe_nombre`, `us`.`nombre_completo` as `sub_nombre`
FROM `equipos`
JOIN `users` as `uj` ON `uj`.`id_users` = `equipos`.`id_jefe`
JOIN `users` as `us` ON `us`.`id_users` = `equipos`.`id_subordinado`
---
    public function listEquipo()
    {
        $data['equipos'] = $this->equipoModel
            ->select('equipos.*, uj.nombre_completo as jefe_nombre, us.nombre_completo as sub_nombre')
            ->join('users as uj', 'uj.id_users = equipos.id_jefe')
            ->join('users as us', 'us.id_users = equipos.id_subordinado')
            ->findAll();

SELECT *
FROM `users`
WHERE `activo` = 1
---
    public function addEquipo()
    {
        $data['users'] = $this->userModel->where('activo', 1)->findAll();

INSERT INTO `equipos` (`id_jefe`, `id_subordinado`, `fecha_asignacion`, `estado_relacion`) VALUES ('52', '58', '2025-07-21 22:48:00', 1)
---
    public function addEquipopost()
    {
        $post = $this->request->getPost();
        $post['fecha_asignacion'] = date('Y-m-d H:i:s');
        $post['estado_relacion']  = 1;
        if (! $this->equipoModel->insert($post)) {