app/Models/UserModel.php

SELECT `users`.*, `roles`.`nombre_rol` AS `rol_nombre`, `areas`.`nombre_area` AS `area_nombre`
FROM `users`
JOIN `roles` ON `roles`.`id_roles` = `users`.`id_roles`
LEFT JOIN `areas` ON `areas`.`id_areas` = `users`.`id_areas`
WHERE `users`.`id_jefe` = '19'
AND `users`.`activo` = 1
---
    public function getSubordinadosDeJefe($idJefe)
    {
        return $this->select('users.*, roles.nombre_rol AS rol_nombre, areas.nombre_area AS area_nombre')
            ->join('roles', 'roles.id_roles = users.id_roles')
            ->join('areas', 'areas.id_areas = users.id_areas', 'left')
            ->where('users.id_jefe', $idJefe)
            ->where('users.activo', 1)
            ->findAll();